nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/U4_485/Device_485.c
/*
    App Gsm uart
*/

#include <rtthread.h> 
#include <rthw.h>
#include "stm32f4xx.h"
#include "usart.h"
#include "board.h"
#include <serial.h>

#include  <stdlib.h>//数字转换成字符串
#include  <stdio.h>
#include  <string.h>
#include "App_moduleConfig.h"



 //---------------变量声明-------------------------------------------
    //第四个字节  0x81: 320x240      0x82 : 640 x480
 u8   Take_photo[10]={0x40,0x40,0x61,0x81,0x02,0X00,0X00,0X02,0X0D,0X0A}; ;   //----  报警拍照命令
 u8   Fectch_photo[10]={0x40,0x40,0x62,0x81,0x02,0X00,0XFF,0XFF,0X0D,0X0A};;   //----- 报警取图命令 


 u8    _485_CameraData_Enable=0;// 有图片数据过来   1: data come  0:   no data 
 u8 	 _485_content[600];
 u16	 _485_content_wr=0;


 
static  u16	 PackageLen=0;//记录每次接收的byte数  
 u8  OpenDoor_StartTakeFlag=0; // 车开关开始拍照状态 ，	开始拍照时	set   1   拍照结束后  0 
 u8   Opendoor_transFLAG=0x02;	   //	车门打开拍照后是否上传标志位  

#ifdef  LCD_5inch
  LARGELCD     DwinLCD;     
#endif

/* 定时器的控制块 */
 static rt_timer_t timer_485; 
 static u8 One_second_Counter_485=0; 
//----------- _485 rx-----
ALIGN(RT_ALIGN_SIZE)
u8    _485_dev_rx[_485_dev_SIZE];       
u16  _485dev_wr=0;      




 struct rt_device  Device_485;
#define                                      _485_MsgQueStack_SIZE  512
static uint8_t					 _485_MsgQueStack[_485_MsgQueStack_SIZE];
static struct rt_messagequeue	 _485_MsgQue;  
MSG_Q_TYPE  _485_MsgQue_sruct;    

_485REC_Struct 	 _485_RXstatus;	  


#ifdef LCD_5inch
void  DwinLCD_Send(void)
{
     u8  i=0;
     u8  send[300];	 
	 
       memset(DwinLCD.Txinfo,0,sizeof(DwinLCD.Txinfo));
     	DwinLCD.TxInfolen=0;
       DwinLCD.Txinfo[0]=0xAA;
 	DwinLCD.Txinfo[1]=0x55;
 	
	switch (DwinLCD.Type)
	{   
	    case  LCD_SETTIME:    //  授时  
	                          /*  AA 55 0A 80 1F 5A 12 09 01 03 11 53 01     -----授时
                                        注： 12 09 01 03 11 53 01 表示  12年 09月01日 星期3 11:53:01
	                          */
	                        DwinLCD.Txinfo[2]=0x0A; 
			          DwinLCD.Txinfo[3]=0x80;
				   DwinLCD.Txinfo[4]=0x1F;  //  寄存器 
			          DwinLCD.Txinfo[5]=0x5A;	  
				   DwinLCD.Txinfo[6]=((((time_now.year))/10)<<4)+(((time_now.year))%10);  	   	
				   DwinLCD.Txinfo[7]=((time_now.month/10)<<4)+(time_now.month%10);  
				   DwinLCD.Txinfo[8]=((time_now.day/10)<<4)+(time_now.day%10); 
				   DwinLCD.Txinfo[9]=0x01; 
				   DwinLCD.Txinfo[10]=((time_now.hour/10)<<4)+(time_now.hour%10);
			          DwinLCD.Txinfo[11]=((time_now.min/10)<<4)+(time_now.min%10);
				   DwinLCD.Txinfo[12]=((time_now.sec/10)<<4)+(time_now.sec%10);       
				    rt_device_write(&Device_485,0,( const char*)DwinLCD.Txinfo,13);		
				    // rt_kprintf("\r\n  授时\r\n"); 	      
				  //    printf(":");
				 //  for(i=0;i<13;i++)   
				     //    printf(" %02X",DwinLCD.Txinfo[i]);     
				  // printf("\r\n"); 	 
				  break;	  
	    case  LCD_SETSPD:   //   速度方向
	                        // AA 55 07 82 00 01 01 30  00 F3 
	                        DwinLCD.Txinfo[2]=0x05; 
                               DwinLCD.Txinfo[3]=0x82;
				   DwinLCD.Txinfo[4]=0x10;
 	                        DwinLCD.Txinfo[5]=0x00;
 	                        DwinLCD.Txinfo[6]=((Speed_gps/10)>>8);     // 速度
 	                        DwinLCD.Txinfo[7]=(u8)(Speed_gps/10);  
				  // DwinLCD.Txinfo[8]=(GPS_direction>>8);	;   //  方向 
 	                       // DwinLCD.Txinfo[9]=GPS_direction; 			
				   rt_device_write(&Device_485,0,( const char*)DwinLCD.Txinfo,8);				
			   
			         break;
	    case  LCD_SDTXT:  
			        //  UART4_output_LongData("\xAA\x55\x05\x82\x10\x00\xFF\xFF",8  );   //  clear screen      
				    WatchDog_Feed();	
			          DwinLCD.Txinfo[2]=5+DwinLCD.TXT_contentLen;   // 长度 
                               DwinLCD.Txinfo[3]=0x82;
				   DwinLCD.Txinfo[4]=0x00;  // LCD ID  
 	                        DwinLCD.Txinfo[5]=0x05;
				   memcpy(DwinLCD.Txinfo+6,DwinLCD.TXT_content,DwinLCD.TXT_contentLen);  
				   DwinLCD.Txinfo[DwinLCD.TXT_contentLen+6]=0xFF;
				   DwinLCD.Txinfo[DwinLCD.TXT_contentLen+7]=0xFF;	
				   //UART4_output_LongData((const char*)DwinLCD.Txinfo,8+DwinLCD.TxInfolen);    
				   DwinLCD.TxInfolen=DwinLCD.TXT_contentLen; 
				   rt_device_write(&Device_485,0,( const char*)DwinLCD.Txinfo,8+DwinLCD.TxInfolen); 	
				    //   rt_thread_delay(8);
				   WatchDog_Feed();
				    delay_ms(20);
					
				   rt_kprintf("\r\n 5 inch LCD:");
				   for(i=0;i<6+DwinLCD.TxInfolen;i++) 
				         rt_kprintf(" %02X",DwinLCD.TXT_content[i]);   
				   rt_kprintf("\r\n");
				    
			         break;	   
	    case  LCD_GPSNUM:  //  GPS 信息   AA 55 05 82 10 01 00 03  最大为20
	                        DwinLCD.Txinfo[2]=5;   // 长度 
                               DwinLCD.Txinfo[3]=0x82;
				   DwinLCD.Txinfo[4]=0x10;  // LCD ID  
 	                        DwinLCD.Txinfo[5]=0x01; 
				   DwinLCD.Txinfo[6]=0x00;  //Data
				   DwinLCD.Txinfo[7]=Satelite_num; 

				    rt_device_write(&Device_485,0,( const char*)DwinLCD.Txinfo,8); 	

			         break;
	   case    LCD_GSMNUM://   GSM 信息  AA 55 05 82 10 02 00 09  最大为31
	                        DwinLCD.Txinfo[2]=5;   // 长度 
                               DwinLCD.Txinfo[3]=0x82;
				   DwinLCD.Txinfo[4]=0x10;  // LCD ID  
 	                        DwinLCD.Txinfo[5]=0x02;  
				   DwinLCD.Txinfo[6]=0x00;  //Data
				   DwinLCD.Txinfo[7]=ModuleSQ;   

				    rt_device_write(&Device_485,0,( const char*)DwinLCD.Txinfo,8); 	  
		                break;
	  case   LCD_VechInfo://  发送车辆信息要拼文本信息

                               DwinLCD.Txinfo[2]=5;   // 长度 
                               DwinLCD.Txinfo[3]=0x82;
				   DwinLCD.Txinfo[4]=0x37;  // LCD ID   
 	                        DwinLCD.Txinfo[5]=0x00;  
				                          //Data
				   memset(send,0,sizeof((const char*)send));                 
				    sprintf(send,"\r\nSocket: %d.%d.%d.%d : %d\r\n",RemoteIP_main[0],RemoteIP_main[1],RemoteIP_main[2],RemoteIP_main[3],RemotePort_main);
				   memcpy(DwinLCD.Txinfo+6,send,strlen(send));	
				   DwinLCD.TxInfolen=6+strlen(send);   

