nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/U4_485/Device_485.c
				    memset(send,0,sizeof((const char*)send));      
				   sprintf(send,"\r\nAPN:   %s\r\n",APN_String); 
                               memcpy(DwinLCD.Txinfo+ DwinLCD.TxInfolen,send,strlen(send));  	 
				   DwinLCD.TxInfolen+=strlen(send);      
				    memset(send,0,sizeof((const char*)send));   
				   sprintf(send,"\r\n车辆入网ID: "); 
				   memcpy(DwinLCD.Txinfo+ DwinLCD.TxInfolen,send,strlen(send));
				   DwinLCD.TxInfolen+=strlen(send);   
				   memcpy(DwinLCD.Txinfo+ DwinLCD.TxInfolen,IMSI_CODE+3,12);   //---- 
				   DwinLCD.TxInfolen+=12;     
				   memset(send,0,sizeof((const char*)send));   
				   sprintf(send,"\r\n\r\n车牌号:   %s",JT808Conf_struct.Vechicle_Info.Vech_Num,strlen((const char*)(JT808Conf_struct.Vechicle_Info.Vech_Num)));
				    memcpy(DwinLCD.Txinfo+ DwinLCD.TxInfolen,send,strlen(send));	
				   DwinLCD.TxInfolen+=strlen(send);    
				   // memset(send,0,sizeof((const char*)send));   
				    //sprintf(send,"\r\n车辆类型: %s",JT808Conf_struct.Vechicle_Info.Vech_Type,strlen((const char*)(JT808Conf_struct.Vechicle_Info.Vech_Type)));
				   // memcpy(DwinLCD.Txinfo+ DwinLCD.TxInfolen,send,strlen(send));	  
				  // DwinLCD.TxInfolen+=strlen(send);    

				   DwinLCD.Txinfo[2]=DwinLCD.TxInfolen-3;  //   补填  
				    rt_device_write(&Device_485,0,( const char*)DwinLCD.Txinfo,DwinLCD.TxInfolen);   	

				       rt_kprintf("\r\n Dwin:");   
				   for(i=0;i<DwinLCD.TxInfolen;i++)  
				         rt_kprintf(" %02X",DwinLCD.Txinfo[i]);        
				   rt_kprintf("\r\n");	 

	                       break;
	   default :
	   	                return;

	}
       //-------------------------
   DwinLCD.Type=LCD_IDLE;          
   DwinLCD.TxInfolen=0;  // 信息长度	     
	//------------------------
}
#endif

#ifdef LCD_5inch
 void DwinLCD_init(void) 
 {
   DwinLCD.CounterTimer=0;
   DwinLCD.Enable_Flag=1;      //   初始化Enable
   DwinLCD.Type=LCD_IDLE;          //  速度方向
   DwinLCD.TxInfolen=0;  // 信息长度
   memset(DwinLCD.Txinfo,0,sizeof(DwinLCD.Txinfo));  

 }
#endif

void  DwinLCD_DispTrigger(void)
{
                     #ifdef  LCD_5inch                                              
				if((time_now.sec==30)&&(DwinLCD.Type==LCD_IDLE))  
					     DwinLCD.Type=LCD_SETTIME;   
				else
				if(((time_now.sec%10)==6)&&(DwinLCD.Type==LCD_IDLE))  
				           DwinLCD.Type=LCD_GPSNUM;
			       else
				if((time_now.sec%10==4)&&(DwinLCD.Type==LCD_IDLE))    
  				 	     DwinLCD.Type=LCD_GSMNUM; 
			      if((time_now.sec%5==0)&&(DwinLCD.Type==LCD_IDLE))     
				        DwinLCD.Type=LCD_SETSPD;       
                             #endif  
}

void  DwinLCD_work_Enable(void)
{ 
     DwinLCD.Enable_Flag=1; 
}
void  DwinLCD_work_Disable(void)
{ 
      DwinLCD.Enable_Flag=0; 
}

void  DwinLCD_Timer(void)
{
    #ifdef LCD_5inch
    if(DwinLCD.Enable_Flag==1)  
    {
          DwinLCD.CounterTimer++;
	   if(	 DwinLCD.CounterTimer>=8)
	   	{
                      DwinLCD_Send();  
			 DwinLCD.CounterTimer=0;	    
 	   	}

    }	
    #endif	
}

void  DwinLCD_Data_Process(void) 
{
     u16   ADD_ID=0,i=0; 
     u16   ContentLen=0;// 实体信息长度
     u8    dwin_reg[50],endtailFlag=0;
     
         //AA 55 08 83 30 00 02 1E FF FF 00               
         //      08 是长度       83  : 指令  33 00 : 地址   02 1E FF FF 00: 内容 

       if(!DwinLCD.Process_Enable)
   	      return   ;   
	 DwinLCD.Process_Enable=0; // clear  
	//   Debug
	rt_kprintf("\r\n DwinLCD Rx:");
	 for(ADD_ID=0;ADD_ID<(DwinLCD.RxInfolen+3);ADD_ID++)
	 	rt_kprintf("%2X ",DwinLCD.RxInfo[ADD_ID]); 
	rt_kprintf("\r\n "); 
     
     if(DwinLCD.RxInfolen>=3)
     	{
                 ContentLen=DwinLCD.RxInfolen-3;
                 ADD_ID=((u16)DwinLCD.RxInfo[4]<<8)+(u16)DwinLCD.RxInfo[5];   

             //   Get useful  infomation    
                  memset(dwin_reg,0,sizeof(dwin_reg));
		    for(i=0;i<ContentLen;i++)				  
		    	{
		    	     if(DwinLCD.RxInfo[6+i]==0xFF)
			     {		
			         switch(endtailFlag)
				   {   case 0:							   
			                            endtailFlag=1;  // 有一个FF
							break;
					case  1:
						       endtailFlag=2; // 有2个 FF 结束了
						       break;
					default:
                                                       return;   // 异常情况返回不处理
				  }	 
		    	      }		
			    else		 
		    	        dwin_reg[i]=DwinLCD.RxInfo[6+i]; 
			    //----------------------------------	
                                  if(endtailFlag==2)
					break;
		    	}
			 
            switch(ADD_ID)
            	{
                  case 0x3000:// 车牌号输入   AA 55 0E 83 30 00 05 BD F2 41 37 37 38 38 FF FF 00
                                      /* 
                                            输入津A67823输出如下：
                                                         AA 55 0E 83 30 00 05 BD F2 41 36 37 38 32 33 FF FF
                                      */
                                      
                                 /*   
                                       //------------------------------------------------------------ 
					   memset((u8*)&JT808Conf_struct.Vechicle_Info.Vech_Num,0,sizeof(JT808Conf_struct.Vechicle_Info.Vech_Num));	//clear	
					  // memcpy(JT808Conf_struct.Vechicle_Info.Vech_Num,dwin_reg,strlen(dwin_reg));
					   memcpy(JT808Conf_struct.Vechicle_Info.Vech_Num,dwin_reg,7); // 国标规定车牌长度7个字节
					   Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));    
					    //------------------------------------------------------------				   
                                       rt_kprintf("\r\n Dwin设置车牌号:%12s",JT808Conf_struct.Vechicle_Info.Vech_Num); 
					  */  				   
						
				         break;
		    case 0x3200: // APN        AA 55 14 83 32 00 08 77 77 77 2E 62 61 69 64 75 2E 63 6F 6D FF FF 00
                                  /*    memset(APN_String,0,sizeof(APN_String));					  
					  memcpy(APN_String,(char*)dwin_reg,strlen(dwin_reg));  
					  memset((u8*)SysConf_struct.APN_str,0,sizeof(APN_String));	
					  memcpy((u8*)SysConf_struct.APN_str,(char*)dwin_reg,strlen(dwin_reg));    
					 Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));


                                     DataLink_APN_Set(APN_String,1); 
                                     */
			               break;
		    case  0x3300:// IP	        AA 55 12 83 33 00 07 31 39 32 2E 31 36 38 2E 31 2E 31 32 FF FF	   
                                    //-------------------------------------------------------------------------
				      /*  i = str2ipport((char*)dwin_reg, RemoteIP_main, &RemotePort_main);
					  if (i <= 4) break;;
					   
					  memset(dwin_reg,0,sizeof(dwin_reg));
					  IP_Str((char*)dwin_reg, *( u32 * ) RemoteIP_main);		   
					  strcat((char*)dwin_reg, " :"); 	  
					  sprintf((char*)dwin_reg+strlen((const char*)dwin_reg), "%u\r\n", RemotePort_main);  
				         memcpy((char*)SysConf_struct.IP_Main,RemoteIP_main,4);
					  SysConf_struct.Port_main=RemotePort_main;
					 Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));

				        DataLink_MainSocket_set(RemoteIP_main,RemotePort_main,1);
						 DataLink_EndFlag=1; //AT_End();  
					*/	 
                                  //--------------------------------------------------------------------------

                                    break;
		    case  0x0999:// 拍照  AA 55 06 83 09 99 01 00 03
                                   //   DEV_regist.Enable_sd=1; // set 发送注册标志位
                                     // rt_kprintf("\r\n 5 寸屏手动发送注册\r\n");
					 break;
		    case  0x0004://车辆信息 AA 55 06 83 00 04 01 00 02
		                         //                       AA 55 06 83 00 04 01 00 02 
                                     DwinLCD.Type=LCD_VechInfo;  
			               break;
		    case   0x3600:  //一键拨号
                                          Speak_ON;
						 rt_kprintf("\r\n   5 寸屏 一键拨号");  
					
	 					  memset(JT808Conf_struct.LISTEN_Num,0,sizeof(JT808Conf_struct.LISTEN_Num));
	 					  memcpy(JT808Conf_struct.LISTEN_Num,"13051953513",11);  										  
                                            Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));   
                                            CallState=CallState_rdytoDialLis;  // 准备开始拨打监听号码 

				    
				       break;
		     //---------------    Add  later --------------------------------------------			   
		     case   0x4100:  //   入网ID 
		                              //AA 55 12 83 41 00 07 30 31 33 36 30 32 30 35 39 31 39 31 FF FF 
                              
				      break;
		    case    0x4114:  //  车辆类型  ---货运
		                             //   AA 55 06 83 41 14 01 00 06 
                                           				// 车辆类型
				      rt_kprintf("\r\n 5 寸屏手动  车辆类型:货运\r\n");

			             break;
		     case    0x4118:  //  车辆类型  ---危险
		                              // AA 55 06 83 41 18 01 00 07
                                            rt_kprintf("\r\n 5 寸屏手动  车辆类型:危险\r\n");
			             break;	
                   case    0x4120:  //  车辆类型  ---客运
                                            // AA 55 06 83 41 20 01 00 08
                                           rt_kprintf("\r\n 5 寸屏手动  车辆类型:客运\r\n");
			             break;
		     case    0x4122:  //  车辆类型  ---出租 
		                              //  AA 55 06 83 41 22 01 00 09
                                            rt_kprintf("\r\n 5 寸屏手动  车辆类型:出租\r\n");
			             break;
		      //-------------------------------------------				 
		     case    0x4110:  //  速度类型  ---GPS
		                              //  AA 55 06 83 41 10 01 00 04 
                                            JT808Conf_struct.Speed_GetType=1; 
					         JT808Conf_struct.DF_K_adjustState=1;		
					         ModuleStatus|=Status_Pcheck;
						  				//  存储
				                 Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
	                                     rt_kprintf("\r\n 5 寸屏手动速度:GPS\r\n");
			             break;				 
		       case    0x4112:  //  速度类型  ---传感器
		                                //AA 55 06 83 41 12 01 00 05 
                                             JT808Conf_struct.Speed_GetType=0;  
					          JT808Conf_struct.DF_K_adjustState=0;	
					          ModuleStatus&=~Status_Pcheck;
				                 //  存储
				                 Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));
                                              rt_kprintf("\r\n 5 寸屏手动速度:传感器\r\n");		  
			             break;	
			//-------------------------------------------	
			case    0x4105:  //  颜色  ---黑
			                         //  AA 55 06 83 41 05 01 00 01 
			                         Menu_color_num=3;
                                              JT808Conf_struct.Vechicle_Info.Dev_Color=Menu_color_num;
						    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));			 
                                               rt_kprintf("\r\n 5 寸屏手动颜色: 黑\r\n");		
						 break;
			case    0x4107:  //  颜色---黄
			                         //AA 55 06 83 41 07 01 00 02   
			                         Menu_color_num=2;
                                              JT808Conf_struct.Vechicle_Info.Dev_Color=Menu_color_num;
						    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));			 
                                               rt_kprintf("\r\n 5 寸屏手动颜色: 黄\r\n");		

			             break;	
			case    0x4108:  //  颜色 ---蓝 
			                         // AA 55 06 83 41 08 01 00 03
			                         Menu_color_num=1;
                                              JT808Conf_struct.Vechicle_Info.Dev_Color=Menu_color_num;
						    Api_Config_Recwrite_Large(jt808,0,(u8*)&JT808Conf_struct,sizeof(JT808Conf_struct));			 
                                              rt_kprintf("\r\n 5 寸屏手动颜色: 蓝 \r\n");		 

			             break;		
			//----------------------------------------
			case   0x4128://   鉴权
			                      // AA 55 06 83 41 28 01 00 12
                                            DEV_Login.Operate_enable=1;			   
			                       DEV_Login.Enable_sd=1; 
						    rt_kprintf("\r\n 5 寸屏手动发送鉴权\r\n");		   
			             break;
			case   0x4124://   注册
			                      //  AA 55 06 83 41 24 01 00 00 
                                           DEV_regist.Enable_sd=1; // set 发送注册标志位
                                            rt_kprintf("\r\n 5 寸屏手动发送注册\r\n");
						//  要发送短信	
						 SMS_send_enable();
			             break;
			case   0x4126: // 清空鉴权			 
                                            // AA 55 06 83 41 26 01 00 11
							
				     break;		 
		    default:
				        break;

