nathanlnw/gghyptCertifyVer/bsp/stm32f407vgt6_RecDrv/app_712/U4_485/Device_485.c
		   //------------------------------------------------ 
	    }	*/		
           //  Dwin  RxProcess
           DwinLCD_Data_Process();
		
	   //--------------------- 拍照数据处理-----	
	   if(_485_CameraData_Enable)	   
	   {
                  Pic_Data_Process();
                _485_CameraData_Enable=0;
	   }		
	    rt_thread_delay(35); 	  		
	    //-------     485  TX ------------------------
           Send_const485(TX_485const_Enable);   		   

	}
}



/* init 485 */
void _485_startup(void)
{
        rt_err_t result;

     //  Msg Que  Init 
       rt_mq_init( &_485_MsgQue, "mq_485", &_485_MsgQueStack[0], 64, _485_MsgQueStack_SIZE, RT_IPC_FLAG_FIFO );
     //  Create  Timer
     timer_485=rt_timer_create("tim_485",timeout_485,RT_NULL,10,RT_TIMER_FLAG_PERIODIC); 
     if(timer_485!=RT_NULL)
          rt_timer_start(timer_485);      



       // -------  thread-------
	result=rt_thread_init(&_485_thread, 
		"485dev",
		_485_thread_entry, RT_NULL,
		&_485_thread_stack[0], sizeof(_485_thread_stack),  
		Prio_485, 10);  

    if (result == RT_EOK)
    {
       rt_thread_startup(&_485_thread); 
   	    rt_kprintf("\r\n 485 thread initial sucess!\r\n");    // nathan add 
    	}
    else
	    rt_kprintf("\r\n485  thread initial fail!\r\n");    // nathan add	   


	Device_485.type	= RT_Device_Class_Char;
	Device_485.init	= Device_485_init;
	Device_485.open	=  Device_485_open;
	Device_485.close	=  Device_485_close;
	Device_485.read	=  Device_485_read;
	Device_485.write	=  Device_485_write;
	Device_485.control =Device_485_control;

	rt_device_register( &Device_485, "485", RT_DEVICE_FLAG_RDWR | RT_DEVICE_FLAG_STANDALONE );
	rt_device_init( &Device_485 );


        //   DwinLCD   Init
        DwinLCD_init(); 
}


